---
kind: method
id: M:Autodesk.Revit.DB.ReferencePoint.GetCoordinatePlaneReferenceXZ
source: html/05a63882-e91c-fb83-e9d5-151459f0e1c3.htm
---
# Autodesk.Revit.DB.ReferencePoint.GetCoordinatePlaneReferenceXZ Method

A reference for the XZ plane of the coordinate
system.

## Syntax (C#)
```csharp
public Reference GetCoordinatePlaneReferenceXZ()
```